In [53]:
import pandas as pd

In [54]:
df = pd.read_csv("dpt2020.csv", delimiter = ";")

In [55]:
df.head()

   sexe        preusuel annais dpt  nombre
0     1  _PRENOMS_RARES   1900  02       7
1     1  _PRENOMS_RARES   1900  04       9
2     1  _PRENOMS_RARES   1900  05       8
3     1  _PRENOMS_RARES   1900  06      23
4     1  _PRENOMS_RARES   1900  07       9

In [56]:
df.shape

(3727553, 5)

In [57]:
df = df.drop(df[df.annais == 'XXXX'].index)
df = df.drop(df[df.preusuel == '_PRENOMS_RARES'].index)
df["sexe"] = df["sexe"].map({1:"M",2:"F"})

In [58]:
df = df.rename(columns={"preusuel": "name", "annais": "year"})

In [61]:
df

        sexe   name  year  dpt  nombre
10885      M  AADIL  1983   84       3
10886      M  AADIL  1992   92       3
10888      M  AAHIL  2016   95       3
10892      M  AARON  1962   75       3
10893      M  AARON  1976   75       3
...      ...    ...   ...  ...     ...
3727545    F    ZYA  2013   44       4
3727546    F    ZYA  2013   59       3
3727547    F    ZYA  2017  974       3
3727548    F    ZYA  2018   59       3
3727550    F   ZYNA  2013   93       3

[3668274 rows x 5 columns]

In [60]:
df.to_csv("filtered_data.csv")

In [25]:
df.groupby('preusuel').nombre.sum().max()

2256072

In [28]:
k = df.groupby("preusuel").nombre.sum().reset_index()

In [32]:
k.nlargest(5, ['nombre'])

      preusuel   nombre
9147     MARIE  2256072
6292      JEAN  1913130
11699   PIERRE   891794
10109   MICHEL   818025
921      ANDRÉ   709633